//---------------------ИСХОДНЫЕ ДАННЫЕ-----------------------------------------------------
var p = 23
var q = 17
var word="краказябра"
//---------------------ИСХОДНЫЕ ДАННЫЕ------------------------------------------------------


var alphabet = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя"
var m = p*q
var f = (p-1)*(q-1) 



//---------------------ВЫЧИСЛЕНИЕ е-----------------------------------------------------
var e
function isCoprime (a, b) {
    while (a != 0 && b != 0){
    if (a > b)
        a = a % b
    else
        b = b % a
    }
    return (a + b)
}
for(e=2;e<f;e++){
    if(isCoprime(f,e)==1){
        break;
    }
}
    
console.log(`openKey = [`,e,',',m,']')
//---------------------ВЫЧИСЛЕНИЕ е-----------------------------------------------------



//---------------------ВЫЧИСЛЕНИЕ d-----------------------------------------------------
var d = 1
while(true){
    if((d*e)%f==1){
        if(d==e) d++
        else break
    }else{
        d++
    }
}
console.log('closedKey = [',d,',',m,']')
//---------------------ВЫЧИСЛЕНИЕ d-----------------------------------------------------



//---------------------Зашифровка слова-----------------------------------------------------
word = word.split("")
var encryptedWord = word.map((value)=>alphabet.indexOf(value)+1)
console.log('WordNumber = ',encryptedWord)
var encryptedWord = encryptedWord.map((value)=>((value)**e)%m)
console.log('encrypterWord = ',encryptedWord)
//---------------------Зашифровка слова-----------------------------------------------------



//---------------------Дешифровка слова-----------------------------------------------------
var decryptedWord =[]
for(i=0;i<encryptedWord.length;i++){
    decryptedWord[i]=(BigInt(encryptedWord[i])**BigInt(d))%BigInt(m)
}
console.log('decryptedWord = ',decryptedWord)
//---------------------Дешифровка слова-----------------------------------------------------